Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/pac.h
/*
 * Component description for PAC
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-09-25T20:48:20Z  */
#ifndef _PIC32CXBZ62_PAC_COMPONENT_H_
#define _PIC32CXBZ62_PAC_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR PAC                       */
/* ************************************************************************** */

/* -------- PAC_WRCTRL : (PAC Offset: 0x00) (R/W 32) Write control -------- */
#define PAC_WRCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (PAC_WRCTRL) Write control  Reset Value */

#define PAC_WRCTRL_PERID_Pos                  _UINT32_(0)                                          /* (PAC_WRCTRL) Peripheral identifier Position */
#define PAC_WRCTRL_PERID_Msk                  (_UINT32_(0xFFFF) << PAC_WRCTRL_PERID_Pos)           /* (PAC_WRCTRL) Peripheral identifier Mask */
#define PAC_WRCTRL_PERID(value)               (PAC_WRCTRL_PERID_Msk & (_UINT32_(value) << PAC_WRCTRL_PERID_Pos)) /* Assignment of value for PERID in the PAC_WRCTRL register */
#define PAC_WRCTRL_KEY_Pos                    _UINT32_(16)                                         /* (PAC_WRCTRL) Peripheral access control key Position */
#define PAC_WRCTRL_KEY_Msk                    (_UINT32_(0xFF) << PAC_WRCTRL_KEY_Pos)               /* (PAC_WRCTRL) Peripheral access control key Mask */
#define PAC_WRCTRL_KEY(value)                 (PAC_WRCTRL_KEY_Msk & (_UINT32_(value) << PAC_WRCTRL_KEY_Pos)) /* Assignment of value for KEY in the PAC_WRCTRL register */
#define   PAC_WRCTRL_KEY_OFF_Val              _UINT32_(0x0)                                        /* (PAC_WRCTRL) No action  */
#define   PAC_WRCTRL_KEY_CLR_Val              _UINT32_(0x1)                                        /* (PAC_WRCTRL) Clear protection  */
#define   PAC_WRCTRL_KEY_SET_Val              _UINT32_(0x2)                                        /* (PAC_WRCTRL) Set protection  */
#define   PAC_WRCTRL_KEY_SETLCK_Val           _UINT32_(0x3)                                        /* (PAC_WRCTRL) Set and lock protection  */
#define PAC_WRCTRL_KEY_OFF                    (PAC_WRCTRL_KEY_OFF_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) No action Position */
#define PAC_WRCTRL_KEY_CLR                    (PAC_WRCTRL_KEY_CLR_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) Clear protection Position */
#define PAC_WRCTRL_KEY_SET                    (PAC_WRCTRL_KEY_SET_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) Set protection Position */
#define PAC_WRCTRL_KEY_SETLCK                 (PAC_WRCTRL_KEY_SETLCK_Val << PAC_WRCTRL_KEY_Pos)    /* (PAC_WRCTRL) Set and lock protection Position */
#define PAC_WRCTRL_Msk                        _UINT32_(0x00FFFFFF)                                 /* (PAC_WRCTRL) Register Mask  */


/* -------- PAC_EVCTRL : (PAC Offset: 0x04) (R/W 8) Event control -------- */
#define PAC_EVCTRL_RESETVALUE                 _UINT8_(0x00)                                        /*  (PAC_EVCTRL) Event control  Reset Value */

#define PAC_EVCTRL_ERREO_Pos                  _UINT8_(0)                                           /* (PAC_EVCTRL) Peripheral acess error event output Position */
#define PAC_EVCTRL_ERREO_Msk                  (_UINT8_(0x1) << PAC_EVCTRL_ERREO_Pos)               /* (PAC_EVCTRL) Peripheral acess error event output Mask */
#define PAC_EVCTRL_ERREO(value)               (PAC_EVCTRL_ERREO_Msk & (_UINT8_(value) << PAC_EVCTRL_ERREO_Pos)) /* Assignment of value for ERREO in the PAC_EVCTRL register */
#define PAC_EVCTRL_Msk                        _UINT8_(0x01)                                        /* (PAC_EVCTRL) Register Mask  */


/* -------- PAC_INTENCLR : (PAC Offset: 0x08) (R/W 8) Interrupt enable clear -------- */
#define PAC_INTENCLR_RESETVALUE               _UINT8_(0x00)                                        /*  (PAC_INTENCLR) Interrupt enable clear  Reset Value */

#define PAC_INTENCLR_ERR_Pos                  _UINT8_(0)                                           /* (PAC_INTENCLR) Peripheral access error interrupt disable Position */
#define PAC_INTENCLR_ERR_Msk                  (_UINT8_(0x1) << PAC_INTENCLR_ERR_Pos)               /* (PAC_INTENCLR) Peripheral access error interrupt disable Mask */
#define PAC_INTENCLR_ERR(value)               (PAC_INTENCLR_ERR_Msk & (_UINT8_(value) << PAC_INTENCLR_ERR_Pos)) /* Assignment of value for ERR in the PAC_INTENCLR register */
#define PAC_INTENCLR_Msk                      _UINT8_(0x01)                                        /* (PAC_INTENCLR) Register Mask  */


/* -------- PAC_INTENSET : (PAC Offset: 0x09) (R/W 8) Interrupt enable set -------- */
#define PAC_INTENSET_RESETVALUE               _UINT8_(0x00)                                        /*  (PAC_INTENSET) Interrupt enable set  Reset Value */

#define PAC_INTENSET_ERR_Pos                  _UINT8_(0)                                           /* (PAC_INTENSET) Peripheral access error interrupt enable Position */
#define PAC_INTENSET_ERR_Msk                  (_UINT8_(0x1) << PAC_INTENSET_ERR_Pos)               /* (PAC_INTENSET) Peripheral access error interrupt enable Mask */
#define PAC_INTENSET_ERR(value)               (PAC_INTENSET_ERR_Msk & (_UINT8_(value) << PAC_INTENSET_ERR_Pos)) /* Assignment of value for ERR in the PAC_INTENSET register */
#define PAC_INTENSET_Msk                      _UINT8_(0x01)                                        /* (PAC_INTENSET) Register Mask  */


/* -------- PAC_INTFLAGAHB : (PAC Offset: 0x10) (R/W 32) Bridge interrupt flag status -------- */
#define PAC_INTFLAGAHB_RESETVALUE             _UINT32_(0x00)                                       /*  (PAC_INTFLAGAHB) Bridge interrupt flag status  Reset Value */

#define PAC_INTFLAGAHB_SRAM0_Pos              _UINT32_(0)                                          /* (PAC_INTFLAGAHB) SRAM0 Position */
#define PAC_INTFLAGAHB_SRAM0_Msk              (_UINT32_(0x1) << PAC_INTFLAGAHB_SRAM0_Pos)          /* (PAC_INTFLAGAHB) SRAM0 Mask */
#define PAC_INTFLAGAHB_SRAM0(value)           (PAC_INTFLAGAHB_SRAM0_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_SRAM0_Pos)) /* Assignment of value for SRAM0 in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_SRAM1_Pos              _UINT32_(1)                                          /* (PAC_INTFLAGAHB) SRAM1 Position */
#define PAC_INTFLAGAHB_SRAM1_Msk              (_UINT32_(0x1) << PAC_INTFLAGAHB_SRAM1_Pos)          /* (PAC_INTFLAGAHB) SRAM1 Mask */
#define PAC_INTFLAGAHB_SRAM1(value)           (PAC_INTFLAGAHB_SRAM1_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_SRAM1_Pos)) /* Assignment of value for SRAM1 in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_SRAM2_Pos              _UINT32_(2)                                          /* (PAC_INTFLAGAHB) SRAM2 Position */
#define PAC_INTFLAGAHB_SRAM2_Msk              (_UINT32_(0x1) << PAC_INTFLAGAHB_SRAM2_Pos)          /* (PAC_INTFLAGAHB) SRAM2 Mask */
#define PAC_INTFLAGAHB_SRAM2(value)           (PAC_INTFLAGAHB_SRAM2_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_SRAM2_Pos)) /* Assignment of value for SRAM2 in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_SRAM3_Pos              _UINT32_(3)                                          /* (PAC_INTFLAGAHB) SRAM3 Position */
#define PAC_INTFLAGAHB_SRAM3_Msk              (_UINT32_(0x1) << PAC_INTFLAGAHB_SRAM3_Pos)          /* (PAC_INTFLAGAHB) SRAM3 Mask */
#define PAC_INTFLAGAHB_SRAM3(value)           (PAC_INTFLAGAHB_SRAM3_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_SRAM3_Pos)) /* Assignment of value for SRAM3 in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_CFLASH_Pos             _UINT32_(4)                                          /* (PAC_INTFLAGAHB) CFLASH Position */
#define PAC_INTFLAGAHB_CFLASH_Msk             (_UINT32_(0x1) << PAC_INTFLAGAHB_CFLASH_Pos)         /* (PAC_INTFLAGAHB) CFLASH Mask */
#define PAC_INTFLAGAHB_CFLASH(value)          (PAC_INTFLAGAHB_CFLASH_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_CFLASH_Pos)) /* Assignment of value for CFLASH in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_PFLASH_Pos             _UINT32_(5)                                          /* (PAC_INTFLAGAHB) PFLASH Position */
#define PAC_INTFLAGAHB_PFLASH_Msk             (_UINT32_(0x1) << PAC_INTFLAGAHB_PFLASH_Pos)         /* (PAC_INTFLAGAHB) PFLASH Mask */
#define PAC_INTFLAGAHB_PFLASH(value)          (PAC_INTFLAGAHB_PFLASH_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_PFLASH_Pos)) /* Assignment of value for PFLASH in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_HPBA_Pos               _UINT32_(6)                                          /* (PAC_INTFLAGAHB) HPBA Position */
#define PAC_INTFLAGAHB_HPBA_Msk               (_UINT32_(0x1) << PAC_INTFLAGAHB_HPBA_Pos)           /* (PAC_INTFLAGAHB) HPBA Mask */
#define PAC_INTFLAGAHB_HPBA(value)            (PAC_INTFLAGAHB_HPBA_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_HPBA_Pos)) /* Assignment of value for HPBA in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_HPBB_Pos               _UINT32_(7)                                          /* (PAC_INTFLAGAHB) HPBB Position */
#define PAC_INTFLAGAHB_HPBB_Msk               (_UINT32_(0x1) << PAC_INTFLAGAHB_HPBB_Pos)           /* (PAC_INTFLAGAHB) HPBB Mask */
#define PAC_INTFLAGAHB_HPBB(value)            (PAC_INTFLAGAHB_HPBB_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_HPBB_Pos)) /* Assignment of value for HPBB in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_HPBC_Pos               _UINT32_(8)                                          /* (PAC_INTFLAGAHB) HPBC Position */
#define PAC_INTFLAGAHB_HPBC_Msk               (_UINT32_(0x1) << PAC_INTFLAGAHB_HPBC_Pos)           /* (PAC_INTFLAGAHB) HPBC Mask */
#define PAC_INTFLAGAHB_HPBC(value)            (PAC_INTFLAGAHB_HPBC_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_HPBC_Pos)) /* Assignment of value for HPBC in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_HPBPIC_Pos             _UINT32_(9)                                          /* (PAC_INTFLAGAHB) HPBPIC0 Position */
#define PAC_INTFLAGAHB_HPBPIC_Msk             (_UINT32_(0x1) << PAC_INTFLAGAHB_HPBPIC_Pos)         /* (PAC_INTFLAGAHB) HPBPIC0 Mask */
#define PAC_INTFLAGAHB_HPBPIC(value)          (PAC_INTFLAGAHB_HPBPIC_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_HPBPIC_Pos)) /* Assignment of value for HPBPIC in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_QSPI_Pos               _UINT32_(10)                                         /* (PAC_INTFLAGAHB) QSPI Position */
#define PAC_INTFLAGAHB_QSPI_Msk               (_UINT32_(0x1) << PAC_INTFLAGAHB_QSPI_Pos)           /* (PAC_INTFLAGAHB) QSPI Mask */
#define PAC_INTFLAGAHB_QSPI(value)            (PAC_INTFLAGAHB_QSPI_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_QSPI_Pos)) /* Assignment of value for QSPI in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_ROT_Pos                _UINT32_(11)                                         /* (PAC_INTFLAGAHB) ROT Position */
#define PAC_INTFLAGAHB_ROT_Msk                (_UINT32_(0x1) << PAC_INTFLAGAHB_ROT_Pos)            /* (PAC_INTFLAGAHB) ROT Mask */
#define PAC_INTFLAGAHB_ROT(value)             (PAC_INTFLAGAHB_ROT_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_ROT_Pos)) /* Assignment of value for ROT in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_CRYPTO_Pos             _UINT32_(12)                                         /* (PAC_INTFLAGAHB) CRYPTO Position */
#define PAC_INTFLAGAHB_CRYPTO_Msk             (_UINT32_(0x1) << PAC_INTFLAGAHB_CRYPTO_Pos)         /* (PAC_INTFLAGAHB) CRYPTO Mask */
#define PAC_INTFLAGAHB_CRYPTO(value)          (PAC_INTFLAGAHB_CRYPTO_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_CRYPTO_Pos)) /* Assignment of value for CRYPTO in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_PBDB_Pos               _UINT32_(13)                                         /* (PAC_INTFLAGAHB) PBDB Position */
#define PAC_INTFLAGAHB_PBDB_Msk               (_UINT32_(0x1) << PAC_INTFLAGAHB_PBDB_Pos)           /* (PAC_INTFLAGAHB) PBDB Mask */
#define PAC_INTFLAGAHB_PBDB(value)            (PAC_INTFLAGAHB_PBDB_Msk & (_UINT32_(value) << PAC_INTFLAGAHB_PBDB_Pos)) /* Assignment of value for PBDB in the PAC_INTFLAGAHB register */
#define PAC_INTFLAGAHB_Msk                    _UINT32_(0x00003FFF)                                 /* (PAC_INTFLAGAHB) Register Mask  */

