Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/pac.h
/* -------- PAC_INTFLAGC : (PAC Offset: 0x1C) (R/W 32) Peripheral interrupt flag status - Bridge C -------- */
#define PAC_INTFLAGC_RESETVALUE               _UINT32_(0x00)                                       /*  (PAC_INTFLAGC) Peripheral interrupt flag status - Bridge C  Reset Value */

#define PAC_INTFLAGC_QSPI_Pos                 _UINT32_(0)                                          /* (PAC_INTFLAGC) QSPI Position */
#define PAC_INTFLAGC_QSPI_Msk                 (_UINT32_(0x1) << PAC_INTFLAGC_QSPI_Pos)             /* (PAC_INTFLAGC) QSPI Mask */
#define PAC_INTFLAGC_QSPI(value)              (PAC_INTFLAGC_QSPI_Msk & (_UINT32_(value) << PAC_INTFLAGC_QSPI_Pos)) /* Assignment of value for QSPI in the PAC_INTFLAGC register */
#define PAC_INTFLAGC_SERCOM6_Pos              _UINT32_(1)                                          /* (PAC_INTFLAGC) SERCOM6 Position */
#define PAC_INTFLAGC_SERCOM6_Msk              (_UINT32_(0x1) << PAC_INTFLAGC_SERCOM6_Pos)          /* (PAC_INTFLAGC) SERCOM6 Mask */
#define PAC_INTFLAGC_SERCOM6(value)           (PAC_INTFLAGC_SERCOM6_Msk & (_UINT32_(value) << PAC_INTFLAGC_SERCOM6_Pos)) /* Assignment of value for SERCOM6 in the PAC_INTFLAGC register */
#define PAC_INTFLAGC_CCL_Pos                  _UINT32_(6)                                          /* (PAC_INTFLAGC) CCL Position */
#define PAC_INTFLAGC_CCL_Msk                  (_UINT32_(0x1) << PAC_INTFLAGC_CCL_Pos)              /* (PAC_INTFLAGC) CCL Mask */
#define PAC_INTFLAGC_CCL(value)               (PAC_INTFLAGC_CCL_Msk & (_UINT32_(value) << PAC_INTFLAGC_CCL_Pos)) /* Assignment of value for CCL in the PAC_INTFLAGC register */
#define PAC_INTFLAGC_AC_Pos                   _UINT32_(7)                                          /* (PAC_INTFLAGC) AC Position */
#define PAC_INTFLAGC_AC_Msk                   (_UINT32_(0x1) << PAC_INTFLAGC_AC_Pos)               /* (PAC_INTFLAGC) AC Mask */
#define PAC_INTFLAGC_AC(value)                (PAC_INTFLAGC_AC_Msk & (_UINT32_(value) << PAC_INTFLAGC_AC_Pos)) /* Assignment of value for AC in the PAC_INTFLAGC register */
#define PAC_INTFLAGC_HMTX_Pos                 _UINT32_(9)                                          /* (PAC_INTFLAGC) HMTX Position */
#define PAC_INTFLAGC_HMTX_Msk                 (_UINT32_(0x1) << PAC_INTFLAGC_HMTX_Pos)             /* (PAC_INTFLAGC) HMTX Mask */
#define PAC_INTFLAGC_HMTX(value)              (PAC_INTFLAGC_HMTX_Msk & (_UINT32_(value) << PAC_INTFLAGC_HMTX_Pos)) /* Assignment of value for HMTX in the PAC_INTFLAGC register */
#define PAC_INTFLAGC_Msk                      _UINT32_(0x000002C3)                                 /* (PAC_INTFLAGC) Register Mask  */

#define PAC_INTFLAGC_SERCOM_Pos               _UINT32_(1)                                          /* (PAC_INTFLAGC Position) SERCOM6 */
#define PAC_INTFLAGC_SERCOM_Msk               (_UINT32_(0x1) << PAC_INTFLAGC_SERCOM_Pos)           /* (PAC_INTFLAGC Mask) SERCOM */
#define PAC_INTFLAGC_SERCOM(value)            (PAC_INTFLAGC_SERCOM_Msk & (_UINT32_(value) << PAC_INTFLAGC_SERCOM_Pos)) 

/* -------- PAC_INTFLAGD : (PAC Offset: 0x20) (R/W 32) Peripheral interrupt flag status - Bridge D -------- */
#define PAC_INTFLAGD_RESETVALUE               _UINT32_(0x00)                                       /*  (PAC_INTFLAGD) Peripheral interrupt flag status - Bridge D  Reset Value */

#define PAC_INTFLAGD_SERCOM2_Pos              _UINT32_(0)                                          /* (PAC_INTFLAGD) SERCOM2 Position */
#define PAC_INTFLAGD_SERCOM2_Msk              (_UINT32_(0x1) << PAC_INTFLAGD_SERCOM2_Pos)          /* (PAC_INTFLAGD) SERCOM2 Mask */
#define PAC_INTFLAGD_SERCOM2(value)           (PAC_INTFLAGD_SERCOM2_Msk & (_UINT32_(value) << PAC_INTFLAGD_SERCOM2_Pos)) /* Assignment of value for SERCOM2 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_SERCOM3_Pos              _UINT32_(1)                                          /* (PAC_INTFLAGD) SERCOM3 Position */
#define PAC_INTFLAGD_SERCOM3_Msk              (_UINT32_(0x1) << PAC_INTFLAGD_SERCOM3_Pos)          /* (PAC_INTFLAGD) SERCOM3 Mask */
#define PAC_INTFLAGD_SERCOM3(value)           (PAC_INTFLAGD_SERCOM3_Msk & (_UINT32_(value) << PAC_INTFLAGD_SERCOM3_Pos)) /* Assignment of value for SERCOM3 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_SERCOM4_Pos              _UINT32_(2)                                          /* (PAC_INTFLAGD) SERCOM4 Position */
#define PAC_INTFLAGD_SERCOM4_Msk              (_UINT32_(0x1) << PAC_INTFLAGD_SERCOM4_Pos)          /* (PAC_INTFLAGD) SERCOM4 Mask */
#define PAC_INTFLAGD_SERCOM4(value)           (PAC_INTFLAGD_SERCOM4_Msk & (_UINT32_(value) << PAC_INTFLAGD_SERCOM4_Pos)) /* Assignment of value for SERCOM4 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_SERCOM5_Pos              _UINT32_(3)                                          /* (PAC_INTFLAGD) SERCOM5 Position */
#define PAC_INTFLAGD_SERCOM5_Msk              (_UINT32_(0x1) << PAC_INTFLAGD_SERCOM5_Pos)          /* (PAC_INTFLAGD) SERCOM5 Mask */
#define PAC_INTFLAGD_SERCOM5(value)           (PAC_INTFLAGD_SERCOM5_Msk & (_UINT32_(value) << PAC_INTFLAGD_SERCOM5_Pos)) /* Assignment of value for SERCOM5 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_TC8_Pos                  _UINT32_(4)                                          /* (PAC_INTFLAGD) TC8 Position */
#define PAC_INTFLAGD_TC8_Msk                  (_UINT32_(0x1) << PAC_INTFLAGD_TC8_Pos)              /* (PAC_INTFLAGD) TC8 Mask */
#define PAC_INTFLAGD_TC8(value)               (PAC_INTFLAGD_TC8_Msk & (_UINT32_(value) << PAC_INTFLAGD_TC8_Pos)) /* Assignment of value for TC8 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_TC9_Pos                  _UINT32_(5)                                          /* (PAC_INTFLAGD) TC9 Position */
#define PAC_INTFLAGD_TC9_Msk                  (_UINT32_(0x1) << PAC_INTFLAGD_TC9_Pos)              /* (PAC_INTFLAGD) TC9 Mask */
#define PAC_INTFLAGD_TC9(value)               (PAC_INTFLAGD_TC9_Msk & (_UINT32_(value) << PAC_INTFLAGD_TC9_Pos)) /* Assignment of value for TC9 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_CAN0_Pos                 _UINT32_(8)                                          /* (PAC_INTFLAGD) CAN0 Position */
#define PAC_INTFLAGD_CAN0_Msk                 (_UINT32_(0x1) << PAC_INTFLAGD_CAN0_Pos)             /* (PAC_INTFLAGD) CAN0 Mask */
#define PAC_INTFLAGD_CAN0(value)              (PAC_INTFLAGD_CAN0_Msk & (_UINT32_(value) << PAC_INTFLAGD_CAN0_Pos)) /* Assignment of value for CAN0 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_CAN1_Pos                 _UINT32_(9)                                          /* (PAC_INTFLAGD) CAN1 Position */
#define PAC_INTFLAGD_CAN1_Msk                 (_UINT32_(0x1) << PAC_INTFLAGD_CAN1_Pos)             /* (PAC_INTFLAGD) CAN1 Mask */
#define PAC_INTFLAGD_CAN1(value)              (PAC_INTFLAGD_CAN1_Msk & (_UINT32_(value) << PAC_INTFLAGD_CAN1_Pos)) /* Assignment of value for CAN1 in the PAC_INTFLAGD register */
#define PAC_INTFLAGD_Msk                      _UINT32_(0x0000033F)                                 /* (PAC_INTFLAGD) Register Mask  */

#define PAC_INTFLAGD_SERCOM_Pos               _UINT32_(0)                                          /* (PAC_INTFLAGD Position) SERCOM2 */
#define PAC_INTFLAGD_SERCOM_Msk               (_UINT32_(0xF) << PAC_INTFLAGD_SERCOM_Pos)           /* (PAC_INTFLAGD Mask) SERCOM */
#define PAC_INTFLAGD_SERCOM(value)            (PAC_INTFLAGD_SERCOM_Msk & (_UINT32_(value) << PAC_INTFLAGD_SERCOM_Pos)) 
#define PAC_INTFLAGD_TC_Pos                   _UINT32_(4)                                          /* (PAC_INTFLAGD Position) TC8 */
#define PAC_INTFLAGD_TC_Msk                   (_UINT32_(0x3) << PAC_INTFLAGD_TC_Pos)               /* (PAC_INTFLAGD Mask) TC */
#define PAC_INTFLAGD_TC(value)                (PAC_INTFLAGD_TC_Msk & (_UINT32_(value) << PAC_INTFLAGD_TC_Pos)) 
#define PAC_INTFLAGD_CAN_Pos                  _UINT32_(8)                                          /* (PAC_INTFLAGD Position) CANx */
#define PAC_INTFLAGD_CAN_Msk                  (_UINT32_(0x3) << PAC_INTFLAGD_CAN_Pos)              /* (PAC_INTFLAGD Mask) CAN */
#define PAC_INTFLAGD_CAN(value)               (PAC_INTFLAGD_CAN_Msk & (_UINT32_(value) << PAC_INTFLAGD_CAN_Pos)) 

