Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/pac.h
/* -------- PAC_STATUSA : (PAC Offset: 0x34) ( R/ 32) Peripheral write protection status - Bridge A -------- */
#define PAC_STATUSA_RESETVALUE                _UINT32_(0x00)                                       /*  (PAC_STATUSA) Peripheral write protection status - Bridge A  Reset Value */

#define PAC_STATUSA_PAC_Pos                   _UINT32_(0)                                          /* (PAC_STATUSA) PAC APB Protect Enable Position */
#define PAC_STATUSA_PAC_Msk                   (_UINT32_(0x1) << PAC_STATUSA_PAC_Pos)               /* (PAC_STATUSA) PAC APB Protect Enable Mask */
#define PAC_STATUSA_PAC(value)                (PAC_STATUSA_PAC_Msk & (_UINT32_(value) << PAC_STATUSA_PAC_Pos)) /* Assignment of value for PAC in the PAC_STATUSA register */
#define PAC_STATUSA_FREQM_Pos                 _UINT32_(1)                                          /* (PAC_STATUSA) FREQM APB Protect Enable Position */
#define PAC_STATUSA_FREQM_Msk                 (_UINT32_(0x1) << PAC_STATUSA_FREQM_Pos)             /* (PAC_STATUSA) FREQM APB Protect Enable Mask */
#define PAC_STATUSA_FREQM(value)              (PAC_STATUSA_FREQM_Msk & (_UINT32_(value) << PAC_STATUSA_FREQM_Pos)) /* Assignment of value for FREQM in the PAC_STATUSA register */
#define PAC_STATUSA_EIC_Pos                   _UINT32_(2)                                          /* (PAC_STATUSA) EIC APB Protect Enable Position */
#define PAC_STATUSA_EIC_Msk                   (_UINT32_(0x1) << PAC_STATUSA_EIC_Pos)               /* (PAC_STATUSA) EIC APB Protect Enable Mask */
#define PAC_STATUSA_EIC(value)                (PAC_STATUSA_EIC_Msk & (_UINT32_(value) << PAC_STATUSA_EIC_Pos)) /* Assignment of value for EIC in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM0_Pos               _UINT32_(3)                                          /* (PAC_STATUSA) SERCOM0 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM0_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM0_Pos)           /* (PAC_STATUSA) SERCOM0 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM0(value)            (PAC_STATUSA_SERCOM0_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM0_Pos)) /* Assignment of value for SERCOM0 in the PAC_STATUSA register */
#define PAC_STATUSA_SERCOM1_Pos               _UINT32_(4)                                          /* (PAC_STATUSA) SERCOM1 APB Protect Enable Position */
#define PAC_STATUSA_SERCOM1_Msk               (_UINT32_(0x1) << PAC_STATUSA_SERCOM1_Pos)           /* (PAC_STATUSA) SERCOM1 APB Protect Enable Mask */
#define PAC_STATUSA_SERCOM1(value)            (PAC_STATUSA_SERCOM1_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM1_Pos)) /* Assignment of value for SERCOM1 in the PAC_STATUSA register */
#define PAC_STATUSA_TC0_Pos                   _UINT32_(5)                                          /* (PAC_STATUSA) TC0 APB Protect Enable Position */
#define PAC_STATUSA_TC0_Msk                   (_UINT32_(0x1) << PAC_STATUSA_TC0_Pos)               /* (PAC_STATUSA) TC0 APB Protect Enable Mask */
#define PAC_STATUSA_TC0(value)                (PAC_STATUSA_TC0_Msk & (_UINT32_(value) << PAC_STATUSA_TC0_Pos)) /* Assignment of value for TC0 in the PAC_STATUSA register */
#define PAC_STATUSA_TC1_Pos                   _UINT32_(6)                                          /* (PAC_STATUSA) TC1 APB Protect Enable Position */
#define PAC_STATUSA_TC1_Msk                   (_UINT32_(0x1) << PAC_STATUSA_TC1_Pos)               /* (PAC_STATUSA) TC1 APB Protect Enable Mask */
#define PAC_STATUSA_TC1(value)                (PAC_STATUSA_TC1_Msk & (_UINT32_(value) << PAC_STATUSA_TC1_Pos)) /* Assignment of value for TC1 in the PAC_STATUSA register */
#define PAC_STATUSA_TC2_Pos                   _UINT32_(7)                                          /* (PAC_STATUSA) TC2 APB Protect Enable Position */
#define PAC_STATUSA_TC2_Msk                   (_UINT32_(0x1) << PAC_STATUSA_TC2_Pos)               /* (PAC_STATUSA) TC2 APB Protect Enable Mask */
#define PAC_STATUSA_TC2(value)                (PAC_STATUSA_TC2_Msk & (_UINT32_(value) << PAC_STATUSA_TC2_Pos)) /* Assignment of value for TC2 in the PAC_STATUSA register */
#define PAC_STATUSA_TC3_Pos                   _UINT32_(8)                                          /* (PAC_STATUSA) TC3 APB Protect Enable Position */
#define PAC_STATUSA_TC3_Msk                   (_UINT32_(0x1) << PAC_STATUSA_TC3_Pos)               /* (PAC_STATUSA) TC3 APB Protect Enable Mask */
#define PAC_STATUSA_TC3(value)                (PAC_STATUSA_TC3_Msk & (_UINT32_(value) << PAC_STATUSA_TC3_Pos)) /* Assignment of value for TC3 in the PAC_STATUSA register */
#define PAC_STATUSA_TC4_Pos                   _UINT32_(9)                                          /* (PAC_STATUSA) TC4 APB Protect Enable Position */
#define PAC_STATUSA_TC4_Msk                   (_UINT32_(0x1) << PAC_STATUSA_TC4_Pos)               /* (PAC_STATUSA) TC4 APB Protect Enable Mask */
#define PAC_STATUSA_TC4(value)                (PAC_STATUSA_TC4_Msk & (_UINT32_(value) << PAC_STATUSA_TC4_Pos)) /* Assignment of value for TC4 in the PAC_STATUSA register */
#define PAC_STATUSA_TC5_Pos                   _UINT32_(10)                                         /* (PAC_STATUSA) TC5 APB Protect Enable Position */
#define PAC_STATUSA_TC5_Msk                   (_UINT32_(0x1) << PAC_STATUSA_TC5_Pos)               /* (PAC_STATUSA) TC5 APB Protect Enable Mask */
#define PAC_STATUSA_TC5(value)                (PAC_STATUSA_TC5_Msk & (_UINT32_(value) << PAC_STATUSA_TC5_Pos)) /* Assignment of value for TC5 in the PAC_STATUSA register */
#define PAC_STATUSA_TC6_Pos                   _UINT32_(11)                                         /* (PAC_STATUSA) TC6 APB Protect Enable Position */
#define PAC_STATUSA_TC6_Msk                   (_UINT32_(0x1) << PAC_STATUSA_TC6_Pos)               /* (PAC_STATUSA) TC6 APB Protect Enable Mask */
#define PAC_STATUSA_TC6(value)                (PAC_STATUSA_TC6_Msk & (_UINT32_(value) << PAC_STATUSA_TC6_Pos)) /* Assignment of value for TC6 in the PAC_STATUSA register */
#define PAC_STATUSA_TC7_Pos                   _UINT32_(12)                                         /* (PAC_STATUSA) TC7 APB Protect Enable Position */
#define PAC_STATUSA_TC7_Msk                   (_UINT32_(0x1) << PAC_STATUSA_TC7_Pos)               /* (PAC_STATUSA) TC7 APB Protect Enable Mask */
#define PAC_STATUSA_TC7(value)                (PAC_STATUSA_TC7_Msk & (_UINT32_(value) << PAC_STATUSA_TC7_Pos)) /* Assignment of value for TC7 in the PAC_STATUSA register */
#define PAC_STATUSA_TCC0_Pos                  _UINT32_(13)                                         /* (PAC_STATUSA) TCC0 APB Protect Enable Position */
#define PAC_STATUSA_TCC0_Msk                  (_UINT32_(0x1) << PAC_STATUSA_TCC0_Pos)              /* (PAC_STATUSA) TCC0 APB Protect Enable Mask */
#define PAC_STATUSA_TCC0(value)               (PAC_STATUSA_TCC0_Msk & (_UINT32_(value) << PAC_STATUSA_TCC0_Pos)) /* Assignment of value for TCC0 in the PAC_STATUSA register */
#define PAC_STATUSA_TCC1_Pos                  _UINT32_(14)                                         /* (PAC_STATUSA) TCC1 APB Protect Enable Position */
#define PAC_STATUSA_TCC1_Msk                  (_UINT32_(0x1) << PAC_STATUSA_TCC1_Pos)              /* (PAC_STATUSA) TCC1 APB Protect Enable Mask */
#define PAC_STATUSA_TCC1(value)               (PAC_STATUSA_TCC1_Msk & (_UINT32_(value) << PAC_STATUSA_TCC1_Pos)) /* Assignment of value for TCC1 in the PAC_STATUSA register */
#define PAC_STATUSA_TCC2_Pos                  _UINT32_(15)                                         /* (PAC_STATUSA) TCC2 APB Protect Enable Position */
#define PAC_STATUSA_TCC2_Msk                  (_UINT32_(0x1) << PAC_STATUSA_TCC2_Pos)              /* (PAC_STATUSA) TCC2 APB Protect Enable Mask */
#define PAC_STATUSA_TCC2(value)               (PAC_STATUSA_TCC2_Msk & (_UINT32_(value) << PAC_STATUSA_TCC2_Pos)) /* Assignment of value for TCC2 in the PAC_STATUSA register */
#define PAC_STATUSA_Msk                       _UINT32_(0x0000FFFF)                                 /* (PAC_STATUSA) Register Mask  */

#define PAC_STATUSA_SERCOM_Pos                _UINT32_(3)                                          /* (PAC_STATUSA Position) SERCOMx APB Protect Enable */
#define PAC_STATUSA_SERCOM_Msk                (_UINT32_(0x3) << PAC_STATUSA_SERCOM_Pos)            /* (PAC_STATUSA Mask) SERCOM */
#define PAC_STATUSA_SERCOM(value)             (PAC_STATUSA_SERCOM_Msk & (_UINT32_(value) << PAC_STATUSA_SERCOM_Pos)) 
#define PAC_STATUSA_TC_Pos                    _UINT32_(5)                                          /* (PAC_STATUSA Position) TCx APB Protect Enable */
#define PAC_STATUSA_TC_Msk                    (_UINT32_(0xFF) << PAC_STATUSA_TC_Pos)               /* (PAC_STATUSA Mask) TC */
#define PAC_STATUSA_TC(value)                 (PAC_STATUSA_TC_Msk & (_UINT32_(value) << PAC_STATUSA_TC_Pos)) 
#define PAC_STATUSA_TCC_Pos                   _UINT32_(13)                                         /* (PAC_STATUSA Position) TCC2 APB Protect Enable */
#define PAC_STATUSA_TCC_Msk                   (_UINT32_(0x7) << PAC_STATUSA_TCC_Pos)               /* (PAC_STATUSA Mask) TCC */
#define PAC_STATUSA_TCC(value)                (PAC_STATUSA_TCC_Msk & (_UINT32_(value) << PAC_STATUSA_TCC_Pos)) 

/* -------- PAC_STATUSB : (PAC Offset: 0x38) ( R/ 32) Peripheral write protection status - Bridge B -------- */
#define PAC_STATUSB_RESETVALUE                _UINT32_(0x02)                                       /*  (PAC_STATUSB) Peripheral write protection status - Bridge B  Reset Value */

#define PAC_STATUSB_DSU_Pos                   _UINT32_(0)                                          /* (PAC_STATUSB) DSU APB Protect Enable Position */
#define PAC_STATUSB_DSU_Msk                   (_UINT32_(0x1) << PAC_STATUSB_DSU_Pos)               /* (PAC_STATUSB) DSU APB Protect Enable Mask */
#define PAC_STATUSB_DSU(value)                (PAC_STATUSB_DSU_Msk & (_UINT32_(value) << PAC_STATUSB_DSU_Pos)) /* Assignment of value for DSU in the PAC_STATUSB register */
#define PAC_STATUSB_DMAC_Pos                  _UINT32_(2)                                          /* (PAC_STATUSB) DMAC APB Protect Enable Position */
#define PAC_STATUSB_DMAC_Msk                  (_UINT32_(0x1) << PAC_STATUSB_DMAC_Pos)              /* (PAC_STATUSB) DMAC APB Protect Enable Mask */
#define PAC_STATUSB_DMAC(value)               (PAC_STATUSB_DMAC_Msk & (_UINT32_(value) << PAC_STATUSB_DMAC_Pos)) /* Assignment of value for DMAC in the PAC_STATUSB register */
#define PAC_STATUSB_EVSYS_Pos                 _UINT32_(3)                                          /* (PAC_STATUSB) EVSYS APB Protect Enable Position */
#define PAC_STATUSB_EVSYS_Msk                 (_UINT32_(0x1) << PAC_STATUSB_EVSYS_Pos)             /* (PAC_STATUSB) EVSYS APB Protect Enable Mask */
#define PAC_STATUSB_EVSYS(value)              (PAC_STATUSB_EVSYS_Msk & (_UINT32_(value) << PAC_STATUSB_EVSYS_Pos)) /* Assignment of value for EVSYS in the PAC_STATUSB register */
#define PAC_STATUSB_RAMECC_Pos                _UINT32_(4)                                          /* (PAC_STATUSB) RAMECC APB Protect Enable Position */
#define PAC_STATUSB_RAMECC_Msk                (_UINT32_(0x1) << PAC_STATUSB_RAMECC_Pos)            /* (PAC_STATUSB) RAMECC APB Protect Enable Mask */
#define PAC_STATUSB_RAMECC(value)             (PAC_STATUSB_RAMECC_Msk & (_UINT32_(value) << PAC_STATUSB_RAMECC_Pos)) /* Assignment of value for RAMECC in the PAC_STATUSB register */
#define PAC_STATUSB_ETH_Pos                   _UINT32_(5)                                          /* (PAC_STATUSB) ETH APB Protect Enable Position */
#define PAC_STATUSB_ETH_Msk                   (_UINT32_(0x1) << PAC_STATUSB_ETH_Pos)               /* (PAC_STATUSB) ETH APB Protect Enable Mask */
#define PAC_STATUSB_ETH(value)                (PAC_STATUSB_ETH_Msk & (_UINT32_(value) << PAC_STATUSB_ETH_Pos)) /* Assignment of value for ETH in the PAC_STATUSB register */
#define PAC_STATUSB_Msk                       _UINT32_(0x0000003D)                                 /* (PAC_STATUSB) Register Mask  */


/* -------- PAC_STATUSC : (PAC Offset: 0x3C) ( R/ 32) Peripheral write protection status - Bridge C -------- */
#define PAC_STATUSC_RESETVALUE                _UINT32_(0x00)                                       /*  (PAC_STATUSC) Peripheral write protection status - Bridge C  Reset Value */

#define PAC_STATUSC_QSPI_Pos                  _UINT32_(0)                                          /* (PAC_STATUSC) QSPI APB Protect Enable Position */
#define PAC_STATUSC_QSPI_Msk                  (_UINT32_(0x1) << PAC_STATUSC_QSPI_Pos)              /* (PAC_STATUSC) QSPI APB Protect Enable Mask */
#define PAC_STATUSC_QSPI(value)               (PAC_STATUSC_QSPI_Msk & (_UINT32_(value) << PAC_STATUSC_QSPI_Pos)) /* Assignment of value for QSPI in the PAC_STATUSC register */
#define PAC_STATUSC_SERCOM6_Pos               _UINT32_(1)                                          /* (PAC_STATUSC) SERCOM6 APB Protect Enable Position */
#define PAC_STATUSC_SERCOM6_Msk               (_UINT32_(0x1) << PAC_STATUSC_SERCOM6_Pos)           /* (PAC_STATUSC) SERCOM6 APB Protect Enable Mask */
#define PAC_STATUSC_SERCOM6(value)            (PAC_STATUSC_SERCOM6_Msk & (_UINT32_(value) << PAC_STATUSC_SERCOM6_Pos)) /* Assignment of value for SERCOM6 in the PAC_STATUSC register */
#define PAC_STATUSC_CCL_Pos                   _UINT32_(6)                                          /* (PAC_STATUSC) CCL APB Protect Enable Position */
#define PAC_STATUSC_CCL_Msk                   (_UINT32_(0x1) << PAC_STATUSC_CCL_Pos)               /* (PAC_STATUSC) CCL APB Protect Enable Mask */
#define PAC_STATUSC_CCL(value)                (PAC_STATUSC_CCL_Msk & (_UINT32_(value) << PAC_STATUSC_CCL_Pos)) /* Assignment of value for CCL in the PAC_STATUSC register */
#define PAC_STATUSC_AC_Pos                    _UINT32_(7)                                          /* (PAC_STATUSC) AC APB Protect Enable Position */
#define PAC_STATUSC_AC_Msk                    (_UINT32_(0x1) << PAC_STATUSC_AC_Pos)                /* (PAC_STATUSC) AC APB Protect Enable Mask */
#define PAC_STATUSC_AC(value)                 (PAC_STATUSC_AC_Msk & (_UINT32_(value) << PAC_STATUSC_AC_Pos)) /* Assignment of value for AC in the PAC_STATUSC register */
#define PAC_STATUSC_HMTX_Pos                  _UINT32_(9)                                          /* (PAC_STATUSC) HMTX Protect Enable Position */
#define PAC_STATUSC_HMTX_Msk                  (_UINT32_(0x1) << PAC_STATUSC_HMTX_Pos)              /* (PAC_STATUSC) HMTX Protect Enable Mask */
#define PAC_STATUSC_HMTX(value)               (PAC_STATUSC_HMTX_Msk & (_UINT32_(value) << PAC_STATUSC_HMTX_Pos)) /* Assignment of value for HMTX in the PAC_STATUSC register */
#define PAC_STATUSC_Msk                       _UINT32_(0x000002C3)                                 /* (PAC_STATUSC) Register Mask  */

